def area(a, b):
    '''
    функция для высчитывания площади прямоугольника

    если a и b это числа, то принимает a,b(стороны) и перемножает их
    иначе выводит ничего (None)

    Example:
    int a = 5
    int b = 3

    return: 15
    '''
    return a * b


def perimeter(a, b):
    '''
    функция для высчитывания периметра прямоугольника

    если a и b это числа, то принимает a,b(стороны) и умножает их сумму на 2
    иначе выводит ничего (None)

    Example:
    int a = 5
    int b = 3

    return: 16
    '''
    return (a + b)*2